[
    {
        "name": "LUKAS",
        "desc1": "Firebase authentication system. A user can log in or register with his/her email and password. The product detail page is private. To place an order, users have to log in first.",
        "desc2": "After logging in, a user will see a dashboard feature to view all his/her order history, and can cancel their order; also a user can give a review to the website.",
        "desc3": "Admin Dashboard functionality. An admin can add or delete products. Cancel orders. Can make a user Admin. The order placed by a user will show by default pending. An Admin will see an approve button after clicking on the button the order will be approved.",
        "technology": "React, React Bootstrap, CSS3, Firebase, Node Js, Express Js, MongoDB Etc.",
        "img1": "https://i.ibb.co/M5h0c95/screely-1638288567082.png",
        "img2": "https://i.ibb.co/dg1qGKm/screely-1638288586830.png",
        "img3": "https://i.ibb.co/P13BRzk/screely-1638288613679.png",
        "liveLink": "https://assignment-12-866b5.web.app/",
        "code": "https://github.com/atikuljaman/Niche-Product-website-Client-side"
    },
    {
        "name": "GOMOTO",
        "desc1": "Secure login system. A user can log in with his/her google account. To place an order, a user has to log in.",
        "desc2": "After successfully logging in, a user will see his/her profile image at the top of the right. Once clicked on it, the user will see dropdown options like my order, manage all orders, add products, create blogs, manage blogs Etc.",
        "desc3": "On my order page, a user will view his/her order history. By default, the order will show pending. On the manage-all order page, a user will see an approve button, once clicked on it the order will be approved or can cancel orders.",
        "desc4": "On the add product page, a user can add products to the website. Users can create blogs; the blog will be pending by default on the Manage Blogs page. On the Manage Blogs page, a user can approve his/her blogs or can delete any blog on the website.",
        "technology": "React, React Bootstrap, CSS3, Firebase, Node Js, Express Js, MongoDB Etc.",
        "img1": "https://i.ibb.co/F3BP3Ys/pj.png",
        "img2": "https://i.ibb.co/Y2ZXkWX/screely-1638288416400.png",
        "img3": "https://i.ibb.co/z5yyPFF/screely-1638288457021.png",
        "liveLink": "https://assignment-11-816e9.web.app/",
        "code": "https://github.com/atikuljaman/GOMOTO-Food-Delivery-Website"
    },
    {
        "name": "MADIBAZAR",
        "desc1": "Medibazar is an online-based medical shop from where a user can order medicine online.",
        "desc2": "To place an order, users have to log in to the website. If a user isn’t logged in and clicks on the product card, he/she will be redirected to the login page. After logging in, the user will be redirected to the product detail page.",
        "desc3": "On the product, details page the user will view the product, and for placing an order user have to provide his/her name, email, address, phone number. After an order is placed successfully, the user will see a dialog box showing a successful order placed message.",
        "technology": "React, React Bootstrap, CSS3, Firebase Etc...",
        "img1": "https://i.ibb.co/XFt8B74/screely-1638288667408.png",
        "img2": "https://i.ibb.co/L0XKn8y/screely-1638288683855.png",
        "img3": "https://i.ibb.co/XtGBgDh/screely-1638288701157.png",
        "liveLink": "https://assignment-10-f1fdf.web.app/",
        "code": "https://github.com/atikuljaman/Medibazar-Medical-Shop-Website"
    }
]